//**********************************************
// File path/File system operations
//  Copyright (c) Rylogic Ltd 2009
//**********************************************
#pragma once
#include <cstdint>
#include <string>
#include <algorithm>
#include <type_traits>
#include <filesystem>
#include <iterator>
#include <fstream>
#include <locale>
#include <codecvt>
#include <cassert>
#include "pr/str/char8.h"
#include "pr/str/string_core.h"

namespace pr::filesys
{
	// Compare two, possibly non-existent, paths.
	inline int Compare(std::filesystem::path const& lhs, std::filesystem::path const& rhs, bool ignore_case)
	{
		auto n0 = lhs.lexically_normal();
		auto n1 = rhs.lexically_normal();
		if (ignore_case)
		{
			n0 = str::LowerCaseC(n0.wstring());
			n1 = str::LowerCaseC(n1.wstring());
		}
		auto r = n0.compare(n1);
		return r;
	}

	// Compare two, possibly non-existent, paths for equality.
	inline bool Equal(std::filesystem::path const& lhs, std::filesystem::path const& rhs, bool ignore_case)
	{
		return Compare(lhs, rhs, ignore_case) == 0;
	}

	// Compare the contents of two files and return true if they are the same.
	// Returns true if both files doesn't exist, or false if only one file exists.
	template <typename = void>
	bool EqualContents(std::filesystem::path const& lhs, std::filesystem::path const& rhs)
	{
		using namespace std::filesystem;

		// Both must exist or not exist
		auto e0 = exists(lhs);

				searched_paths->push_back(path.parent_path());
		}

		// Return an empty string for unresolved
		return path{};
	}
}

#if PR_UNITTESTS
#include <fstream>
#include "pr/common/unittests.h"
namespace pr::filesys
{
	PRUnitTest(FilesysTests)
	{
		using namespace std::filesystem;

		{// std::filesystem tests
			auto p0 = path{ L"C:\\dir\\file.txt" };
			auto p1 = path{ "C:/DIR/DIR2/../FiLE.TXT" };

			// Just turns the path into normal form
			auto n0 = p0.lexically_normal();
			auto n1 = p1.lexically_normal();

			// Weakly canonical resolves simlinks for the parts of the path that actually exist.
			auto c0 = weakly_canonical(p0);
			auto c1 = weakly_canonical(p1);

			// equivalent requires the file/directory to exist
			PR_THROWS([=] { [[maybe_unused]] auto _ = equivalent(p0, p1); }, filesystem_error);

			// canonical requires the file/directory to exist
			PR_THROWS([=] { [[maybe_unused]] auto _ = canonical(p0); }, filesystem_error);

			//
			try
			{
				//// Path compare is case insensitive (on windows)
				//auto r0 = weakly_canonical(p0).compare(weakly_canonical(p1));
				//PR_CHECK(r0 == 0, true);
			
			}
			catch (filesystem_error const& ex)
			{
				unittests::out() << ex.what();
				throw;
			}
		}
		{// Equal paths
			auto p0 = path{ L"C:\\dir\\file.txt" };
			auto p1 = path{ "C:/DIR/DIR2/../FiLE.TXT" };
			PR_CHECK(Equal(p0, p1, true), true);
		}
		{// Equal contents
			auto file_content0 = temp_dir / L"file_content0.bin";
			auto file_content1 = temp_dir / L"file_content1.bin";
			auto file_content2 = temp_dir / L"file_content2.bin";

			char const content0[] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 };
			char const content1[] = { 0, 1, 2, 3, 'A', 5, 6, 7, 8, 9 };
			{
				std::ofstream file(file_content0);
				PR_CHECK(file.write(&content0[0], sizeof(content0)).good(), true);
			}
			{
				std::ofstream file(file_content1);
				PR_CHECK(file.write(&content1[0], sizeof(content1)).good(), true);
			}
			{
				std::ofstream file(file_content2);
				PR_CHECK(file.write(&content0[0], sizeof(content0)).good(), true);
			}

			PR_CHECK(EqualContents(file_content0, file_content0), true);
			PR_CHECK(EqualContents(file_content0, file_content1), false);
			PR_CHECK(EqualContents(file_content0, file_content2), true);
		}
		{// Buffer to/from File
			auto filepath = temp_dir / L"file_test.txt";
			{// Simple read text file
				std::u8string text = char8_ptr(u8"你好，This is some test text");
				WriteAllText(text, filepath);
				auto read = ReadAllText(filepath);
				PR_CHECK(read, text);
			}
			{// Write binary - Read binary
				{// write bytes
					unsigned char const data[] = { '0', '1', '2', '3', '4', '5' };
					BufferToFile(data, 0, _countof(data), filepath, EEncoding::binary);

					{// Read binary data into 'std::vector<byte>', no conversion
						auto read = FileToBuffer<std::vector<unsigned char>>(filepath, EEncoding::binary);
						PR_CHECK(read.size() == sizeof(data), true);
						PR_CHECK(memcmp(&read[0], data, sizeof(data)) == 0, true);
					}
					{// Read binary data into 'std::wstring', no conversion
						auto read = FileToBuffer<std::wstring>(filepath, EEncoding::binary);
						PR_CHECK(read.size() == (sizeof(data) + 1) / 2, true);
						PR_CHECK(memcmp(&read[0], data, sizeof(data)) == 0, true);
					}
				}
				{// write !bytes
					unsigned short const data[] = { '0', '1', '2', '3', '4', '5' };
					BufferToFile(data, 0, _countof(data), filepath, EEncoding::binary);

					{// Read binary data into 'std::vector<byte>', no conversion
						auto read = FileToBuffer<std::vector<unsigned char>>(filepath, EEncoding::binary);
						PR_CHECK(read.size() == sizeof(data), true);
						PR_CHECK(memcmp(&read[0], data, sizeof(data)) == 0, true);
					}
					{// Read binary data into 'std::wstring', no conversion
						auto read = FileToBuffer<std::wstring>(filepath, EEncoding::binary);
						PR_CHECK(read.size() == sizeof(data) / 2, true);
						PR_CHECK(memcmp(&read[0], data, sizeof(data)) == 0, true);
					}
				}
			}
			{// Write UTF-8 text
				unsigned char const utf8[] = { 0xe4, 0xbd, 0xa0, 0xe5, 0xa5, 0xbd, '\n', 0xe4, 0xbd, 0xa0, 0xe5, 0xa5, 0xbd }; // 'ni hao'
				wchar_t const utf16[] = { 0x4f60, 0x597d, '\n', 0x4f60, 0x597d };

				BufferToFile(utf8, 0, _countof(utf8), filepath, EEncoding::utf8, EEncoding::utf8, false, true);
				PR_CHECK(DetectFileEncoding(filepath) == EEncoding::utf8, true);

				{// Read UTF-8 - BOM automatically stripped
					auto read = FileToBuffer<std::string>(filepath, EEncoding::utf8);
					PR_CHECK(read.size() == _countof(utf8), true);
					PR_CHECK(memcmp(&read[0], utf8, sizeof(utf8)) == 0, true);
				}
				{// Read UTF-8 to UTF-16 - BOM automatically stripped
					auto read = FileToBuffer<std::wstring>(filepath, EEncoding::utf16_le);
					PR_CHECK(read.size() == _countof(utf16), true);
					PR_CHECK(memcmp(&read[0], utf16, sizeof(utf16)) == 0, true);
				}
				{// Read UTF-8 to UCS2 - BOM automatically stripped
					auto read = FileToBuffer<std::wstring>(filepath, EEncoding::ucs2_le);
					PR_CHECK(read.size() == _countof(utf16), true);
					PR_CHECK(memcmp(&read[0], utf16, sizeof(utf16)) == 0, true);
				}
			}
			{// Write UTF-16 text
				unsigned char const utf8[] = { 0xe4, 0xbd, 0xa0, 0xe5, 0xa5, 0xbd, '\n', 0xe4, 0xbd, 0xa0, 0xe5, 0xa5, 0xbd }; // 'ni hao'
				wchar_t const utf16[] = { 0x4f60, 0x597d, '\n', 0x4f60, 0x597d };
				wchar_t const utf16be[] = { 0x604f, 0x7d59, 0x0A00, 0x604f, 0x7d59 };

				BufferToFile(utf16, 0, _countof(utf16), filepath, EEncoding::utf16_le, EEncoding::utf16_le, false, true);
				PR_CHECK(DetectFileEncoding(filepath) == EEncoding::utf16_le, true);

				{// Read UTF-16 to UTF-16 - BOM automatically stripped
					auto read = FileToBuffer<std::wstring>(filepath, EEncoding::utf16_le);
					PR_CHECK(read.size() == _countof(utf16), true);
					PR_CHECK(memcmp(&read[0], utf16, sizeof(utf16)) == 0, true);
				}
				{// Read UTF-16 to UTF-16be - BOM automatically stripped
					auto read = FileToBuffer<std::wstring>(filepath, EEncoding::utf16_be);
					PR_CHECK(read.size() == _countof(utf16be), true);
					PR_CHECK(memcmp(&read[0], utf16be, sizeof(utf16be)) == 0, true);
				}
				{// Read UTF-16 to UTF-8 - BOM automatically stripped
					auto read = FileToBuffer<std::string>(filepath, EEncoding::utf8);
					PR_CHECK(read.size() == _countof(utf8), true);
					PR_CHECK(memcmp(&read[0], utf8, sizeof(utf8)) == 0, true);
				}
			}
			{// todo...
			}
		}
		{// Enumerate filesystem
			create_directories(temp_dir / L"dir1" / L"dir2");
			BufferToFile({ 0, 1, 2, 3, 4 }, temp_dir / L"dir1" / L"bytes.bin");
			BufferToFile("0123456789", temp_dir / L"dir1" / L"digits.txt");
			BufferToFile("ABCDEFGHIJ", temp_dir / L"dir1" / L"dir2" / L"letters.txt");

			std::vector<path> files;
			std::vector<path> dirs;
			for (auto& dir_entry : recursive_directory_iterator(temp_dir / L"dir1"))
			{
				if (dir_entry.is_directory())
					dirs.push_back(dir_entry.path());
				else
					files.push_back(dir_entry.path());
			}
			PR_CHECK(files.size(), 3U);
			PR_CHECK(Equal(files[0], temp_dir / L"dir1" / L"bytes.bin", true), true);
			PR_CHECK(Equal(files[1], temp_dir / L"dir1" / L"digits.txt", true), true);
			PR_CHECK(Equal(files[2], temp_dir / L"dir1" / L"dir2" / L"letters.txt", true), true);
			PR_CHECK(dirs.size(), 1U);
