//*****************************************
// Zip Compression
//	Copyright (c) Rylogic 2019
//*****************************************
// This code is based on the 'miniz' library.
// Refactored to make use of modern C++ language features.
// See the file end for copyright notices.
#pragma once

#include <memory>
#include <string>
#include <vector>
#include <unordered_map>
#include <limits>
#include <iostream>
#include <sstream>
#include <fstream>
#include <algorithm>
#include <filesystem>
#include <cstdint>
#include <cctype>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <time.h>
#include <sys/stat.h>
#if defined(_MSC_VER) || defined(__MINGW64__)
#include <sys/utime.h>
#elif defined(__MINGW32__)
#include <sys/utime.h>
#elif defined(__TINYC__)
#include <sys/utime.h>
#elif defined(__GNUC__) && _LARGEFILE64_SOURCE
#include <utime.h>
#else
#include <utime.h>
#endif

namespace pr::storage::zip
{
	template <typename TAlloc = std::allocator<void>>
	class ZipArchiveA
	{
		// Notes:
		//  - Zip File Format Reference: https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT
		//  - Deflate algorithm reference: https://www.w3.org/Graphics/PNG/RFC-1951#algorithm
		//  - ZLIB compressed data format spec: https://tools.ietf.org/html/rfc1950

		static_assert(sizeof(uint16_t) == 2);
		static_assert(sizeof(uint32_t) == 4);
		static_assert(sizeof(uint64_t) == 8);

	public:

		// Per-entry compression methods
		enum class EMethod :uint16_t
		{
			None = 0,
			Shrunk = 1,
			Reduce1 = 2,
			Reduce2 = 3,
			Reduce3 = 4,
			Reduce4 = 5,
			Implode = 6,
			Reserved_for_Tokenizing_Compression_Algorithm = 7,
			Deflate = 8,
			Deflate64 = 9,
			PKWARE_Data_Compression_Library_Imploding = 10,
			Reserved_by_PKWARE_1 = 11,
			BZIP2 = 12,
			Reserved_by_PKWARE_2 = 13,
			LZMA = 14,
			Reserved_by_PKWARE_3 = 15,
			IBM_CMPSC = 16,
			Reserved_by_PKWARE_4 = 17,
			IBM_TERSE = 18,
			IBM_LZ77 = 19, // z Architecture (PFS)
			JPEG_Variant = 96,
			WavPack = 97,
			PPMd = 98, // version I, Rev 1
			AE_x = 99, // encryption marker (see APPENDIX E)
		};

		// Archive flags
		enum class EZipFlags
		{
			None = 0,

			// Used when searching for items by name
			IgnoreCase = 1 << 0,

			// Used when searching for items by name
			IgnorePath = 1 << 1,

			// Used when adding and extracting items. Does not calculate or check CRC's.
			IgnoreCrc = 1 << 2,
			
			// Used when opening an archive. Generates a hash table of zip entry names to
			// offsets allowing for faster access to contained files. Combine with 'IgnoreCase' and 'IgnorePath'
			FastNameLookup = 1 << 3,

			// Used in 'Extract' to copy data without decompressing it
			CompressedData = 1 << 4,
		};

		// Compression levels: 0-9 are the standard zlib-style levels, 10 is best possible compression (not zlib compatible, and may be very slow), MZ_DEFAULT_COMPRESSION=MZ_DEFAULT_LEVEL.
		enum class ECompressionLevel
		{
			None = 0,
			Fastest = 1,
			Default = 6,
			Best = 9,
			Uber = 10,
		};

		// Zip file header flags
		enum class EBitFlags :uint16_t
		{
			None = 0,
			Encrypted             = 1 << 0,
			CompressionFlagBit1   = 1 << 1, 
			CompressionFlagBit2   = 1 << 2,
			DescriptorUsedMask    = 1 << 3,
			Reserved1             = 1 << 4,
			PatchFile             = 1 << 5,
			StrongEncrypted       = 1 << 6,
			CurrentlyUnused1      = 1 << 7,
			CurrentlyUnused2      = 1 << 8,
			CurrentlyUnused3      = 1 << 9,
			CurrentlyUnused4      = 1 << 10,
			Utf8                  = 1 << 11, // filename and comment encoded using UTF-8
			ReservedPKWARE1       = 1 << 12,
			CDEncrypted           = 1 << 13, // Used when encrypting the Central Directory to indicate selected data values in the Local Header are masked to hide their actual values.
			ReservedPKWARE2       = 1 << 14,
			ReservedPKWARE3       = 1 << 15,
		};

		// The mode this archive is in
		enum class EMode
		{
			Invalid = 0,
			Reading = 1,
			Writing = 2,
		};

		#pragma pack(push, 1)

		// Local directory header
		struct LDH
		{
			static uint32_t const Signature = 0x04034b50; // PK34

			uint32_t Sig;
			uint16_t Version;
			EBitFlags BitFlags;
			EMethod  Method;
			uint16_t FileTime;
			uint16_t FileDate;
			uint32_t Crc;
			uint32_t CompressedSize;
			uint32_t UncompressedSize;
			uint16_t NameSize;
			uint16_t ExtraSize;

			// Following this header:
			// char    Name[NameSize];
			// uint8_t Extra[ExtraSize];
			// uint8_t Data[CompressedSize];

			LDH() = default;
			LDH(size_t item_name_size, size_t extra_size, size_t uncompressed_size, size_t compressed_size, uint32_t uncompressed_crc32, EMethod method, EBitFlags bit_flags, uint16_t dos_time, uint16_t dos_date)
				:Sig(Signature)
				,Version()
				,BitFlags(bit_flags)
				,Method(method)
				,FileTime(dos_time)
				,FileDate(dos_date)
				,Crc(uncompressed_crc32)
				,CompressedSize(checked_cast<uint32_t>(compressed_size))
				,UncompressedSize(checked_cast<uint32_t>(uncompressed_size))
				,NameSize(checked_cast<uint16_t>(item_name_size))
				,ExtraSize(checked_cast<uint16_t>(extra_size))
			{}
			std::string_view ItemName() const
			{
				return std::string_view(reinterpret_cast<char const*>(this + 1), NameSize);
			}
			std::span<void> Extra() const
			{
				return std::span<void>(reinterpret_cast<uint8_t const*>(this + 1) + NameSize, ExtraSize);
			}
			std::span<void> Data() const
			{
				return std::span<void>(reinterpret_cast<uint8_t const*>(this + 1) + NameSize + ExtraSize, CompressedSize);
			}
		};
		static_assert(sizeof(LDH) == 30);
		static_assert(std::is_pod_v<LDH>);

		// Central directory header
		struct CDH
		{
			static uint32_t const Signature = 0x02014b50;// PK12

			uint32_t Sig;
			uint16_t VersionMadeBy;
			uint16_t VersionNeeded;
			EBitFlags BitFlags;
			EMethod  Method;
			uint16_t FileTime;
			uint16_t FileDate;
			uint32_t Crc;
			uint32_t CompressedSize;
			uint32_t UncompressedSize;
			uint16_t NameSize;
			uint16_t ExtraSize;
			uint16_t CommentSize;
			uint16_t DiskNumberStart;
			uint16_t InternalAttributes;
			uint32_t ExternalAttributes;
			uint32_t LocalHeaderOffset;

			// Following this header:
			// char    ItemName[NameSize];
			// uint8_t Extra[ExtraSize];
			// uint8_t ItemComment[ItemCommentSize];

			CDH() = default;
			CDH(size_t name_size, size_t extra_size, size_t comment_size, size_t uncompressed_size, size_t compressed_size, uint32_t uncompressed_crc32, EMethod method, EBitFlags bit_flags, uint16_t dos_time, uint16_t dos_date, size_t local_header_ofs, uint32_t ext_attributes, uint16_t int_attributes)
				:Sig(Signature)
				,VersionMadeBy()
				,VersionNeeded(method == EMethod::Deflate ? 20 : 0)
				,BitFlags(bit_flags)
				,Method(method)
				,FileTime(dos_time)
				,FileDate(dos_date)
				,Crc(uncompressed_crc32)
				,CompressedSize(checked_cast<uint32_t>(compressed_size))
				,UncompressedSize(checked_cast<uint32_t>(uncompressed_size))
				,NameSize(checked_cast<uint16_t>(name_size))
				,ExtraSize(checked_cast<uint16_t>(extra_size))
				,CommentSize(checked_cast<uint16_t>(comment_size))
				,DiskNumberStart()
				,InternalAttributes(int_attributes)
				,ExternalAttributes(ext_attributes)
				,LocalHeaderOffset(checked_cast<uint32_t>(local_header_ofs))
			{}
			std::string_view ItemName() const
			{
				return std::string_view(reinterpret_cast<char const*>(this + 1), NameSize);
			}
			std::span<void> Extra() const
			{
				return std::span<void>(reinterpret_cast<uint8_t const*>(this + 1) + NameSize, ExtraSize);
			}
			std::string_view Comment() const
			{
				return std::string_view(reinterpret_cast<char const*>(this + 1) + NameSize + ExtraSize, CommentSize);
			}
			bool IsDirectory() const
			{
				return
					NameSize != 0 && *(reinterpret_cast<char const*>(this + 1) + NameSize - 1) == '/' ||
					// Bugfix: This code was also checking if the internal attribute was non-zero, which wasn't correct.
					// Most/all zip writers (hopefully) set DOS file/directory attributes in the low 16-bits, so check for the DOS directory flag and ignore the source OS ID in the created by field.
					// FIXME: Remove this check? Is it necessary - we already check the filename.
					has_flag(ExternalAttributes, DOSSubDirectoryFlag);
			}
			time_t Time() const
			{
				return DosTimeToTime(FileTime, FileDate);
			}
		};
		static_assert(sizeof(CDH) == 46);
		static_assert(std::is_pod_v<CDH>);

		// End of central directory
		struct ECDH
		{
			static uint32_t const Signature = 0x06054b50; // PK56

			uint32_t Sig;                 // Magic number signature
			uint16_t DiskNumber;          // The number of this disk in a multi-disk archive
			uint16_t CDirDiskNumber;      // The disk containing the start of the central directory
			uint16_t NumEntriesOnDisk;    // The number of entries on this disk
			uint16_t TotalEntries;        // The number of entries on the central directory
			uint32_t CDirSize;            // The central directory size
			uint32_t CDirOffset;          // Offset to the start of central directory, relative to the 'CDirDiskNumber' disk
			uint16_t CommentSize;         // ZIP comment

			// Following this header:
			//   char Comment[CommentLength];

			ECDH() = default;
			ECDH(uint16_t disk_number, uint16_t cdir_disk_number, uint16_t num_entries_on_disk, uint16_t total_entries, uint32_t cdir_size, uint32_t cdir_offset, uint16_t comment_size)
				:Sig(Signature)
				,DiskNumber(disk_number)
				,CDirDiskNumber(cdir_disk_number)
				,NumEntriesOnDisk(num_entries_on_disk)
				,TotalEntries(total_entries)
				,CDirSize(cdir_size)
				,CDirOffset(cdir_offset)
				,CommentSize(comment_size)
			{}
		};
		static_assert(sizeof(ECDH) == 22);
		static_assert(std::is_pod_v<ECDH>);

		#pragma pack(pop)

	private:

		using allocator_t = TAlloc;
		using alloc_traits_t = typename std::allocator_traits<allocator_t>;
		template <typename U> using allocator_u = typename alloc_traits_t::template rebind_alloc<U>;
		template <typename T> using vector_t = std::vector<T, allocator_u<T>>;
		using name_hash_index_pair_t = struct { uint64_t name_hash; int index; };
		using string_t = std::basic_string<char, allocator_u<char>>;
		using iarray_t = std::basic_string_view<uint8_t>;
		using oarray_t = vector_t<uint8_t>;

		// Constants
		static size_t const LZDictionarySize = 0x8000;
		static uint32_t const DOSSubDirectoryFlag = 0x10;
		static uint32_t const InitialCrc = 0;

		// Read/Write function pointer types. Functions are expected to read/write 'n' bytes or throw.
		using read_func_t = void(*)(ZipArchiveA const& me, int64_t file_ofs, void* buf, size_t n);
