//********************************
// PR3d Model file format
//  Copyright (c) Rylogic Ltd 2014
//********************************
// Binary 3d model format
// Based on 3ds.
// This model format is designed for load speed
// Use zip if you want compressed model data.

#pragma once

#include <string>
#include <vector>
#include <iostream>
#include <memory>
#include <exception>
#include <cassert>
#include "pr/macros/enum.h"
#include "pr/common/cast.h"
#include "pr/common/fmt.h"
#include "pr/common/colour.h"
#include "pr/common/range.h"
#include "pr/common/scope.h"
#include "pr/geometry/common.h"
#include "pr/geometry/utility.h"
#include "pr/maths/maths.h"

namespace pr
{
	namespace geometry
	{
		namespace p3d
		{
			typedef unsigned char u8;       static_assert(sizeof(u8)  == 1, "1byte u8 expected");
			typedef unsigned short u16;     static_assert(sizeof(u16) == 2, "2byte u16 expected");
			typedef unsigned long u32;      static_assert(sizeof(u32) == 4, "4byte u32 expected");
			typedef unsigned long long u64; static_assert(sizeof(u64) == 8, "8byte u64 expected");
			static const u32 Version = 0x00001000;
			struct ChunkHeader;
			struct ChunkIndex;
			ChunkIndex const& NullChunk();

			#pragma region Chunk Ids
			#define PR_ENUM(x)\
			x(Null           ,= 0x00000000)/* Null chunk                                            */\
			x(CStr           ,= 0x00000001)/* Null terminated ascii string                          */\
			x(Main           ,= 0x44335250)/* PR3D File type indicator                              */\
			x(FileVersion    ,= 0x00000100)/* ├─ File Version                                       */\
			x(Scene          ,= 0x00001000)/* └─ Scene                                              */\
			x(Materials      ,= 0x00002000)/*    ├─ Materials                                       */\
			x(Material       ,= 0x00002100)/*    │  └─ Material                                     */\
			x(DiffuseColour  ,= 0x00002110)/*    │     ├─ Diffuse Colour                            */\
			x(DiffuseTexture ,= 0x00002120)/*    │     └─ Diffuse texture                           */\
			x(TexFilepath    ,= 0x00002121)/*    │        ├─ Texture filepath                       */\
			x(TexTiling      ,= 0x00002122)/*    │        └─ Texture tiling                         */\
			x(Meshes         ,= 0x00003000)/*    └─ Meshes                                          */\
			x(Mesh           ,= 0x00003100)/*       └─ Mesh of lines,triangles,tetras               */\
			x(MeshName       ,= 0x00003101)/*          ├─ Name (cstr)                               */\
			x(MeshBBox       ,= 0x00003102)/*          ├─ Bounding box (BBox)                       */\
			x(MeshVertices   ,= 0x00003110)/*          ├─ Vertex list (u32 count, count * [Vert])   */\
			x(MeshIndices    ,= 0x00003120)/*          ├─ Index list (u32 count, count * [u16 i])   */\
			x(MeshIndices32  ,= 0x00003121)/*          ├─ Index list (u32 count, count * [u32 i])   */\
			x(MeshNuggets    ,= 0x00003200)/*          └─ Nugget list (u32 count, count * [Nugget]) */

			PR_DEFINE_ENUM2(EChunkId, PR_ENUM);
			#undef PR_ENUM
			#pragma endregion
			static_assert(sizeof(EChunkId) == sizeof(u32), "");

			struct ChunkHeader
			{
				EChunkId m_id;
				u32      m_length;
			};
			static_assert(sizeof(ChunkHeader) == 8, "Incorrect chunk header size");

			// Used to build an index of a p3d file
			struct ChunkIndex :ChunkHeader
			{
				std::vector<ChunkIndex> m_chunks;

				ChunkIndex(EChunkId id, size_t data_length)
					:ChunkHeader({id, s_cast<u32>(sizeof(ChunkHeader) + data_length)})
					,m_chunks()
				{}
				ChunkIndex(EChunkId id, size_t data_length, std::initializer_list<ChunkIndex> chunks)
					:ChunkHeader({id, s_cast<u32>(sizeof(ChunkHeader) + data_length)})
					,m_chunks()
				{
					for (auto& c : chunks)
						add(c);
				}
				void add(ChunkIndex chunk)
				{
					m_chunks.emplace_back(chunk);
					m_length += chunk.m_length;
				}
				ChunkIndex const& operator[](EChunkId id) const
				{
					for (auto& c : m_chunks)
						if (c.m_id == id)
							return c;
					
					std::stringstream ss; ss << "Child chunk " << id << " not a member of chunk " << m_id;
					throw std::exception(ss.str().c_str());
				}
