//********************************
// PR3d Model file format
//  Copyright (c) Rylogic Ltd 2014
//********************************
// Binary 3d model format
// Based on 3ds.
// This model format is designed for load speed
// Use zip if you want compressed model data.
#pragma once
#include <string>
#include <vector>
#include <iostream>
#include <memory>
#include <exception>
#include <cassert>
#include "pr/macros/enum.h"
#include "pr/common/cast.h"
#include "pr/common/fmt.h"
#include "pr/common/range.h"
#include "pr/common/scope.h"
#include "pr/common/compress.h"
#include "pr/maths/maths.h"
#include "pr/gfx/colour.h"
#include "pr/geometry/common.h"
#include "pr/geometry/utility.h"
#include "pr/container/span.h"
#include "pr/container/byte_data.h"

namespace pr::geometry::p3d
{
	using u8 = unsigned char;       static_assert(sizeof(u8) == 1, "1byte u8 expected");
	using u16 = unsigned short;     static_assert(sizeof(u16) == 2, "2byte u16 expected");
	using u32 = unsigned long;      static_assert(sizeof(u32) == 4, "4byte u32 expected");
	using u64 = unsigned long long; static_assert(sizeof(u64) == 8, "8byte u64 expected");
	struct ChunkHeader;
	struct ChunkIndex;
	static const u32 Version = 0x00001001;
	ChunkIndex const& NullChunk();

	#pragma region Chunk Ids
	#define PR_ENUM(x)\
	x(Null                  ,= 0x00000000)/* Null chunk                                                      */\
	x(CStr                  ,= 0x00000001)/* Null terminated ascii string                                    */\
	x(Main                  ,= 0x44335250)/* PR3D File type indicator                                        */\
	x(FileVersion           ,= 0x00000100)/* ├─ File Version                                                 */\
	x(Scene                 ,= 0x00001000)/* └─ Scene                                                        */\
	x(Materials             ,= 0x00002000)/*    ├─ Materials                                                 */\
	x(Material              ,= 0x00002100)/*    │  └─ Material                                               */\
	x(DiffuseColour         ,= 0x00002110)/*    │     ├─ Diffuse Colour                                      */\
	x(DiffuseTexture        ,= 0x00002120)/*    │     └─ Diffuse texture                                     */\
	x(TexFilepath           ,= 0x00002121)/*    │        ├─ Texture filepath                                 */\
	x(TexTiling             ,= 0x00002122)/*    │        └─ Texture tiling                                   */\
	x(Meshes                ,= 0x00003000)/*    └─ Meshes                                                    */\
	x(Mesh                  ,= 0x00003100)/*       └─ Mesh of lines,triangles,tetras                         */\
	x(MeshName              ,= 0x00003101)/*          ├─ Name (cstr)                                         */\
	x(MeshBBox              ,= 0x00003102)/*          ├─ Bounding box (BBox)                                 */\
	x(MeshTransform         ,= 0x00003103)/*          ├─ Mesh to Parent Transform (m4x4)                     */\
	x(MeshVertices          ,= 0x00003110)/*          ├─ Vertex list (u32 count, count * [Vert])             */\
	x(MeshVerticesV         ,= 0x00003111)/*          ├─ Vertex list compressed (u32 count, count * [Verts]) */\
	x(MeshIndices16         ,= 0x00003120)/*          ├─ Index list (u32 count, count * [u16 i]) deprecated  */\
	x(MeshIndices32         ,= 0x00003121)/*          ├─ Index list (u32 count, count * [u32 i]) deprecated  */\
	x(MeshIndices           ,= 0x00003125)/*          ├─ Index list (u32 count, u32 stride, count * [Idx i]) */\
	x(MeshIndicesV          ,= 0x00003126)/*          ├─ Index list (u32 count, u32 stride, count * [Idx i]) */\
	x(MeshNuggets           ,= 0x00003200)/*          └─ Nugget list (u32 count, count * [Nugget]) */
	PR_DEFINE_ENUM2(EChunkId, PR_ENUM);
	#undef PR_ENUM
	#pragma endregion
	static_assert(sizeof(EChunkId) == sizeof(u32), "Chunk Ids must be 4 bytes");

	// Flags
	enum class EFlags
	{
		None = 0,
		Compress = 1 << 0,
		_bitwise_operators_allowed,
	};

	// Chunk header (8-bytes)
	struct ChunkHeader
	{
		// Notes:
		//  - 'm_length' includes the size of the ChunkHeader

		EChunkId m_id;
		u32 m_length;

		ChunkHeader() = default;
		ChunkHeader(EChunkId id, size_t data_length)
			:m_id(id)
			,m_length(s_cast<u32>(sizeof(ChunkHeader) + data_length))
		{}
	};
	static_assert(sizeof(ChunkHeader) == 8, "Incorrect chunk header size");

	// Used to build an index of a p3d file
	struct ChunkIndex :ChunkHeader
	{
		// Notes:
		//  - data_length in these constructors should *not* include the ChunkHeader size
		using Cont = std::vector<ChunkIndex>;
		Cont m_chunks;

		ChunkIndex(EChunkId id, size_t data_length)
			:ChunkHeader(id, data_length)
			,m_chunks()
		{}
		ChunkIndex(EChunkId id, size_t data_length, std::initializer_list<ChunkIndex> chunks)
			:ChunkHeader(id, data_length)
			,m_chunks()
		{
			for (auto& c : chunks)
				add(c);
		}
		void add(ChunkIndex const& chunk)
		{
			m_chunks.push_back(chunk);
			m_length += chunk.m_length;
		}
		ChunkIndex const& operator[](EChunkId id) const
		{
			for (auto& c : m_chunks)
				if (c.m_id == id)
					return c;

			std::stringstream ss;
			ss << "Child chunk " << id << " not a member of chunk " << m_id;
			throw std::runtime_error(ss.str());
		}
